Enums/упУчастникиДокументооборотаПеревозки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упУчастникиДокументооборотаПеревозки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Грузоотправитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Грузополучатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заказчик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упУчастникиДокументооборотаПеревозки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не ПолучитьФункциональнуюОпцию("упИспользуетсяПолучениеПередачаДокументовВТочкахРейса") Тогда 
		СтандартнаяОбработка = Ложь;
		
		СписокИсключений = Новый СписокЗначений;
		СписокИсключений.Добавить(Перечисления.упУчастникиДокументооборотаПеревозки.Грузоотправитель);
		СписокИсключений.Добавить(Перечисления.упУчастникиДокументооборотаПеревозки.Грузополучатель);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	упУчастникиДокументооборотаПеревозки.Ссылка
		|ИЗ
		|	Перечисление.упУчастникиДокументооборотаПеревозки КАК упУчастникиДокументооборотаПеревозки
		|ГДЕ
		|	НЕ упУчастникиДокументооборотаПеревозки.Ссылка В (&СписокИсключений)
		|
		|УПОРЯДОЧИТЬ ПО
		|	упУчастникиДокументооборотаПеревозки.Порядок";
		Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
		
		ДанныеВыбора = Новый СписокЗначений;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			ДанныеВыбора.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
